
import { SurveyPage } from './types';

// Define the survey pages
export const surveyPages: SurveyPage[] = [
  {
    pageId: 'page1',
    questions: [
      {
        questionId: 'q1',
        text: 'الأشخاص الذين يعانون من اضطرابات التواصل أقل قدرة على التعلم مقارنة بالأشخاص غير المصابين.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q2',
        text: 'الأشخاص الذين يعانون من اضطرابات التواصل يجدون صعوبة في التفكير المعقد واتخاذ القرارات.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q3',
        text: 'يميل الأشخاص الذين يعانون من اضطرابات التواصل إلى أن يكونوا أقل اجتماعية من غيرهم.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q4',
        text: 'من الصعب إجراء محادثة ممتعة مع شخص يعاني من اضطرابات التواصل.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
    ],
  },
  {
    pageId: 'page2',
    questions: [
      {
        questionId: 'q5',
        text: 'من السهل إجراء محادثة ممتعة مع شخص يعاني من اضطرابات التواصل.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q6',
        text: 'يجب إعطاء الأولوية في العلاج للأشخاص الذين لديهم احتمال أكبر للتحسن.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q7',
        text: 'بعض اضطرابات التواصل ليست بحاجة إلى تدخل علاجي لأنها لا تؤثر بشكل كبير على حياة الشخص.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q8',
        text: 'يجب إعطاء الأولوية في العلاج للأشخاص بغض النظر عن احتمالات تحسنهم.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
    ],
  },
  {
    pageId: 'page3',
    questions: [
      {
        questionId: 'q9',
        text: 'الأشخاص الذين يعانون من اضطرابات التواصل لديهم فرص أقل للنجاح في حياتهم المهنية.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q10',
        text: 'من الأفضل للأطفال الذين لديهم اضطرابات التواصل أن يتلقوا تعليمًا في بيئات خاصة بدلاً من المدارس العادية.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q11',
        text: 'أفضل ان تكون علاقاتي رسمية مع الأشخاص الذين لديهم اضطرابات التواصل.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q12',
        text: 'أرى ان الأشخاص الذين لديهم اضطرابات التواصل غير قادرين على التحكم بمشاعرهم وردات فعلهم العاطفية.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
    ],
  },
];
