
import { SurveyPage } from './types';

// Define the survey pages
export const surveyPages: SurveyPage[] = [
  {
    pageId: 'page1',
    questions: [
      {
        questionId: 'q1',
        text: 'أعتقد أن الأشخاص الذين يعانون من صعوبات في التواصل أقل كفاءة من غيرهم.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q2',
        text: 'أشعر بالراحة عند التفاعل مع شخص يعاني من صعوبات في التواصل.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
    ],
  },
  {
    pageId: 'page2',
    questions: [
      {
        questionId: 'q3',
        text: 'أعتقد أن دمج الأشخاص ذوي الاحتياجات الخاصة في المجتمع يمثل عبئًا على الموارد.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q4',
        text: 'لديّ معرفة كافية حول التحديات التي تواجه الأشخاص ذوي الاحتياجات الخاصة.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
    ],
  },
  {
    pageId: 'page3',
    questions: [
      {
        questionId: 'q5',
        text: 'أجد صعوبة في فهم احتياجات الأشخاص الذين يعانون من صعوبات في التواصل.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
      {
        questionId: 'q6',
        text: 'أعتقد أن الأشخاص الذين يعانون من صعوبات في التواصل يحتاجون إلى معاملة خاصة.',
        type: 'radio',
        options: ['أوافق بشدة', 'أوافق', 'محايد', 'لا أوافق', 'لا أوافق بشدة'],
      },
    ],
  },
];
